Revit 2026 API

# TileTileChangeColumn Property

---

The property labeled "Amount" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileChangeColumn { get; }
```
```vb
Public Shared ReadOnly Property TileChangeColumn As String
	Get
```
```cpp
public:
static property String^ TileChangeColumn {
	String^ get ();
}
```
```fsharp
static member TileChangeColumn : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 5".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace